/**
 * 得分权重表
 *
 * 使用 `scoreMap[nameSpace] ?? 0` 来获取具体权重
 */
const scoreMap: {
  [ns in NameSpaceId]: number;
} = {
  0: 3, // 主
  1: 0.125, // 主讨论
  2: 0, // 用户
  3: 0,
  4: 1, // project
  5: 0.125, // project 讨论
  6: 0.25, // 文件
  7: 0,
  8: 0,
  9: 0,
  10: 2.5, // 模板
  11: 0.125, // 模板讨论
  12: 2, // 帮助
  13: 0,
  14: 1, // 分类
  15: 0,
  274: 0,
  275: 0,
  710: 0,
  711: 0,
  2300: 0,
  2301: 0,
  2302: 0,
  2303: 0,
  3100: 0,
  3101: 0,
  [-1]: 0, // 特殊
};
// 彻底封存
Object.freeze(scoreMap);
export { scoreMap };
